package study.java.basic.variable;

public class Array {
	/*
	 * 	- 배열은 같은 타입의 여러 변수를 하나의 묶음으로 다루는 것
	 * 
	 * 	배열의 선언 : 타입[] 변수이름;
	 * 	배열의 생성 : new 타입[길이];
	 * 	=> 한 줄로 가능.
	 * 	배열의 초기화 : 값을 처음으로 할당해 주는 것
	 * 
	 * 	- index 로 상수 대신 변수나 수식도 사용 가능.
	 * 
	 * 	cf) 길이가 0인 배열도 생성 가능.
	 * 
	 * 	cf) 배열은 한 번 생성하면 길이를 변경할 수 없음.
	 * 
	 * 
	 * 	==> 배열의 길이를 변경하는 방법 :
	 * 
	 * 	1. 더 큰 배열을 새로 생성한다.
	 * 	2. 기존 배열의 내용을 새로운 배열에 복사한다.
	 * 	
	 * 	
	 * 	cf) 선언과 생성을 따로 할 경우에는 new 타입[] 을 생략할 수 없다.
	 * 
	 * 	cf) 배열을 출력하면 '타입@주소' 의 형식으로 출력된다.
	 * 
	 * 	
	 * 	배열의 복사 : 
	 * 
	 * 	1. 새로운 배열을 만들고 for 문을 이용해 값을 복사.
	 * 
	 * 	2. System.arraycopy() 를 이용한 배열의 복사.
	 * 	(지정된 범위의 값들을 통째로 복사해서 효율적임)
	 * 
	 * 	
	 * 	
	 */
}
