package study.java.basic;

public class Introduction {
	/*
	 * 	#자바의 특징
	 * 
	 * 	1. 운영체제 독립적
	 * 	- JVM 종속적
	 * 
	 *	2. 객체지향언어
	 *	- 상속
	 *	- 캡슐화
	 *	- 다형성  
	 *
	 *	3. 자동 메모리 관리(Garbage Collection)
	 *
	 *	4. 네트워크와 분선처리를 지원
	 *
	 *	5. 멀티쓰레드 지원
	 *
	 *	6. 동적 로딩
	 *
	 *	=======
	 *
	 *	Java API 문서
	 *	https://docs.oracle.com/en/java/javase/15/
	 *
	 *	=======
	 *
	 *	- 자바 코드는 반드시 클래스 안에 존재
	 *  - 주석을 제외한 모든 코드는 클래스의 블럭 {} 내에 작성해야 함.
	 *	- main 메서드는 항상 똑같이 적어줘야 함
	 *	- 자바 애플리케이션은 main 메서드의 호출로 시작해서 main 메서드의 마지막 문장까지 수행을 마치면 종료
	 *	- 모든 클래스가 main 메서드를 가지고 있어야 하는 것은 아니지만,
	 * 	하나의 Java 애플리케이션에는 main 메서드를 포함한 클래스가 반드시 하나는 있어야 한다. (시작지점)
	 * 
	 * 	- 하나의 소스파일에 하나의 클래스만을 정의하는 것이 보통이지만,
	 *  하나의 소스파일에 둘 이상의 클래스를 정의하는 것도 가능하다.
	 *  이 때, 소스파일의 이름은 public class 의 이름과 일치해야 한다.
	 *  만일 소스파일 내에 public class가 없다면 소스파일 내의 어떤 클래스의 이름으로 해도 상관없다.
	 *  
	 *  - 하나의 소스파일에 둘 이상의 public class 가 존재하면 안 된다.
	 *  
	 *  
	 */
}
